
class PostPage {
// PostPage：AppbarにはAdd Postというタイトルが白色で表示されており、Appbarの背景色は青です。
// 画面下部に、縦方向に並んだ3つのリストがあります。
// 下から順に、画像を選択する、動画を選択する、動画を撮るという項目です。背景色は青色で、文字色は白色です。
// それ以外の空白のページは何も操作できないようになっています。

}




// HomePageは、アカウント登録をしていなくても6つの動画までは閲覧することができます。6つの動画を見たあとは、登録画面がモーダルで表示されます。
// SearchPageは、グリッドビューの画面のみ登録なしでも見れるが、グリッドビューをタップすると登録ページをモーダルで表示します。
// 検索フォームやカテゴリをタップしても、登録ページをモーダルで表示します。
// PostPage ,ProfilePage ,SettingPageは、どれを選択しても登録画面がモーダルで表示されます。
// 登録ページは、Passkeysパッケージを使用します。
// Solanaアドレスも生成されます。
// 登録は、課金とともに完了します。
// 登録は、apple payかgoogle payの1800円のサブスク月額課金で完了します。

